zlgopen/ametal/soc/mm32/drivers/source/gpio/am_mm32l373_gpio.c
/*******************************************************************************
*                                 AMetal
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2018 Guangzhou ZHIYUAN Electronics Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
*******************************************************************************/

/**
 * \file
 * \brief GPIO驱动，服务GPIO标准接口
 *
 * \internal
 * \par Modification history
 * - 1.00 17-08-22  zcb,first implementation
 * \endinternal
 */

#include "am_mm32l373_gpio.h"
#include "am_gpio_util.h"
#include "am_gpio.h"
#include "am_int.h"
#include "am_bitops.h"
#include "am_mm32l373_gpio_util.h"
#include "amhw_mm32l373_afio.h"
#include "amhw_mm32l373_exti.h"
#include "mm32l373_pin.h"

/*******************************************************************************
* 私有定义
*******************************************************************************/

/** \brief 中断未连接标识 */
#define AM_MM32L373_GPIO_INVALID_PIN_MAP    0xFF

/** \brief 定义指向GPIO设备信息的指针 */
#define __GPIO_DEVINFO_DECL(p_gpio_devinfo, p_dev)  \
        const am_mm32l373_gpio_devinfo_t *p_gpio_devinfo = p_dev->p_devinfo

/******************************************************************************
  全局变量
******************************************************************************/

/** \bruef 指向GPIO设备的指针 */
am_mm32l373_gpio_dev_t *__gp_gpio_dev;

/*******************************************************************************
  公共函数
*******************************************************************************/

static int __am_mm32l373_peripheral_remap_clear(int pin)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    amhw_mm32l373_afio_remap_peripheral_t peripheral;
    amhw_mm32l373_afio_t                  *p_hw_afio;
    uint8_t i = 0;

    if (NULL == p_gpio_devinfo) {
        return -AM_ENXIO;
    }

    p_hw_afio  = (amhw_mm32l373_afio_t *)p_gpio_devinfo->afio_regbase;
    peripheral = p_gpio_devinfo->p_remap[pin];

    if (peripheral == AMHW_MM32L373_NO_REMAP) {
        return -AM_ENXIO;
    }

    /* JATG / SWD 引脚选择性关闭 */
    if (peripheral != AMHW_MM32L373_SWJ_CFG) {

        /*
         * 将外设在GPIO中重映像的改组引脚全部重置为AMHW_MM32L373_NO_REMAP
         * 表明改组引脚现在已没有重映像
         */

        for (i = 0 ; i < p_gpio_devinfo->pin_count ; i++) {
            if (p_gpio_devinfo->p_remap[i] == peripheral) {
                p_gpio_devinfo->p_remap[i] = AMHW_MM32L373_NO_REMAP;
            }
        }

    } else {
        /*
         * JTMS/SWDIO -- PA13   JTCK/SWCLK    -- PA14
         * JTDI       -- PA15   JTDO/TRACESWO -- PB3
         * JNTRST     -- PB4
         *
         * 0  --  无可用引脚
         * 1  --  PB4
         * 2  --  PB3/PB4/PA15
         * 7  --  PB3/PB4/PA15/PA14/PA13
         */
        if ((PIOA_13 == pin) || (PIOA_14 == pin)) {

            amhw_mm32l373_afio_swj_cfg_remap_mode_set(p_hw_afio, AMHW_MM32L373_AFIO_SWJ_CFG_7);

            /* 清除引脚重映像信息 */
            for (i = PIOA_13 ; i < PIOB_5 ; i++) {
                if (p_gpio_devinfo->p_remap[i] == AMHW_MM32L373_SWJ_CFG) {
                    p_gpio_devinfo->p_remap[i] = AMHW_MM32L373_NO_REMAP;
                }
            }

            /* 如果使用A15/B3 且模式不是位于7 */
        } else if (((PIOA_15 == pin) || (PIOB_3 == pin)) &&
                 (p_gpio_devinfo->p_remap[PIOA_13] != AMHW_MM32L373_NO_REMAP)){

            amhw_mm32l373_afio_swj_cfg_remap_mode_set(p_hw_afio, AMHW_MM32L373_AFIO_SWJ_CFG_2);

            /* 清除引脚重映像信息 */
            p_gpio_devinfo->p_remap[PIOB_3]  = AMHW_MM32L373_NO_REMAP;
            p_gpio_devinfo->p_remap[PIOB_4]  = AMHW_MM32L373_NO_REMAP;
            p_gpio_devinfo->p_remap[PIOA_15] = AMHW_MM32L373_NO_REMAP;

        } else if ((PIOB_4 == pin) &&
                 (p_gpio_devinfo->p_remap[PIOB_3] != AMHW_MM32L373_NO_REMAP)) {

            amhw_mm32l373_afio_swj_cfg_remap_mode_set(p_hw_afio, AMHW_MM32L373_AFIO_SWJ_CFG_1);

            /* 清除引脚重映像信息 */
            p_gpio_devinfo->p_remap[PIOB_4]  = AMHW_MM32L373_NO_REMAP;
        }
    }

    /* 关闭外设重映像 */
    switch (peripheral) {

    case AMHW_MM32L373_SPI1_REMAP:
        amhw_mm32l373_afio_spi1_pin_remap_disable(p_hw_afio);
        break;

    case AMHW_MM32L373_I2C1_REMAP:
        amhw_mm32l373_afio_i2c1_pin_remap_disable(p_hw_afio);
        break;

    case AMHW_MM32L373_UART1_REMAP:
        amhw_mm32l373_afio_uart_pin_remap_disable(p_hw_afio, 1);
        break;

    case AMHW_MM32L373_UART3_REMAP:
        amhw_mm32l373_afio_uart_pin_remap_disable(p_hw_afio, 3);
        break;

    case AMHW_MM32L373_TIM1_REMAP:
        amhw_mm32l373_afio_tim1_pin_remap_disable(p_hw_afio);
        break;

    case AMHW_MM32L373_PD01_REMAP:
        amhw_mm32l373_afio_pd01_pin_remap_disable(p_hw_afio);
        break;

    case AMHW_MM32L373_TIM2_REMAP:
        amhw_mm32l373_afio_tim2_remap_mode_set(p_hw_afio, AMHW_MM32L373_AFIO_TIM2_REMAP_NO);
        break;

    case AMHW_MM32L373_TIM3_REMAP:
        amhw_mm32l373_afio_tim3_remap_mode_set(p_hw_afio ,AMHW_MM32L373_AFIO_TIM3_REMAP_NO);
        break;

    case AMHW_MM32L373_CAN_REMAP:
        amhw_mm32l373_afio_can_remap_mode_set(p_hw_afio ,AMHW_MM32L373_AFIO_CAN_RX_PA11_TX_PA12);
        break;

    case AMHW_MM32L373_SWJ_CFG:
        break;

    default:
        return -AM_ENOTSUP;
    }

    return AM_OK;
}

/**
 * \brief 引脚功能配置
 *
 * \param[in] pin   : 引脚编号，值为 PIO* (#PIOA_0)
 * \param[in] flags : 引脚功能
 *
 * \return AM_OK ：配置成功
 */
int am_gpio_pin_cfg (int pin, uint32_t flags)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    amhw_mm32l373_gpio_t     *p_hw_gpio  = NULL;
    amhw_mm32l373_afio_t     *p_hw_afio  = NULL;
    amhw_mm32l373_gpiomode_t  pin_mode   = AMHW_MM32L373_GPIO_MODE_AIN;
    uint32_t                func = 0, mode = 0;
    /* IO口方向 */
    uint8_t dir = 0;

    if (__gp_gpio_dev == NULL) {
        return -AM_ENXIO;
    }

    if (AM_FALSE == __gp_gpio_dev->valid_flg) {
        return -AM_ENODEV;
    }

