zlgopen/ametal/soc/mm32/drivers/source/gpio/am_mm32l373_gpio.c
    p_hw_gpio  = (amhw_mm32l373_gpio_t *)p_gpio_devinfo->gpio_regbase;
    p_hw_afio  = (amhw_mm32l373_afio_t *)p_gpio_devinfo->afio_regbase;

    func = AM_GPIO_COM_FUNC_GET(flags);
    mode = AM_GPIO_COM_MODE_GET(flags);

    /* 标准层相关 */
    if (0 != func) {

        /* 使用标准层前先退回引脚为GPIO模式 */
        __am_mm32l373_peripheral_remap_clear(pin);

        switch (func) {

        case AM_GPIO_INPUT_VAL:
            /* 设置方向为输入 */
            amhw_mm32l373_gpio_pin_dir_input(p_hw_gpio, pin);
            break;

        case AM_GPIO_OUTPUT_INIT_HIGH_VAL:
            /* 设置输出模式，如没有设置则默认为50Mhz */
            if (0 == (flags & AM_MM32L373_GPIO_OUTRES_RATE)) {
                amhw_mm32l373_gpio_pin_dir_output(p_hw_gpio,
                                                AMHW_MM32L373_GPIO_SPEED_50MHz,
                                                pin);
            } else {
                amhw_mm32l373_gpio_pin_dir_output(
                    p_hw_gpio,
                    (amhw_mm32l373_gpio_speed_mode_t)AM_MM32L373_GPIO_OUTRES_RATE_GET(flags),
                    pin);
            }
            /* 输出高电平 */
            amhw_mm32l373_gpio_pin_out_high(p_hw_gpio, pin);
            /* 推挽输出 */
            amhw_mm32l373_gpio_pin_mode_set(p_hw_gpio,
                                          AMHW_MM32L373_GPIO_MODE_OUT_PP,
                                          pin);
            break;

        case AM_GPIO_OUTPUT_INIT_LOW_VAL:
            /* 设置输出模式，如没有设置则默认为50Mhz */
            if (0 == (flags & AM_MM32L373_GPIO_OUTRES_RATE)) {
                amhw_mm32l373_gpio_pin_dir_output(p_hw_gpio,
                                                AMHW_MM32L373_GPIO_SPEED_50MHz,
                                                pin);
            } else {
                amhw_mm32l373_gpio_pin_dir_output(
                    p_hw_gpio,
                    (amhw_mm32l373_gpio_speed_mode_t)AM_MM32L373_GPIO_OUTRES_RATE_GET(flags),
                    pin);
            }
            /* 输出低电平 */
            amhw_mm32l373_gpio_pin_out_low(p_hw_gpio, pin);
            /* 推挽输出 */
            amhw_mm32l373_gpio_pin_mode_set(p_hw_gpio,
                                          AMHW_MM32L373_GPIO_MODE_OUT_PP,
                                          pin);
            break;

        default:
            return -AM_ENOTSUP;
        }
    }

    if (mode != 0x00) {

        /* 获取输入输出方向 */
        dir = amhw_mm32l373_gpio_pin_dir_get(p_hw_gpio, pin);

        switch (mode) {

        case AM_GPIO_PULL_UP_VAL:
            if (dir != 1) {

                /* 使OD位置为1, 表明是上拉 */
                amhw_mm32l373_gpio_pin_out_high(p_hw_gpio, pin);

                pin_mode = AMHW_MM32L373_GPIO_MODE_IPU;
            } else {

                /* 输出没有上拉模式，设置为推挽模式 */
                pin_mode = AMHW_MM32L373_GPIO_MODE_OUT_PP;
            }
            break;

        case AM_GPIO_PULL_DOWN_VAL:
            if (dir != 1) {

                /* 使OD位置为0, 表明是下拉 */
                amhw_mm32l373_gpio_pin_out_low(p_hw_gpio, pin);
                pin_mode = AMHW_MM32L373_GPIO_MODE_IPD;
            } else {

                /* 输出没有下拉模式，设置为推挽模式 */
                pin_mode = AMHW_MM32L373_GPIO_MODE_OUT_PP;
            }
            break;

        case AM_GPIO_FLOAT_VAL:
            if (dir != 1) {
                pin_mode = AMHW_MM32L373_GPIO_MODE_IN_FLOATING;
            } else {

                /* 输出没有浮空模式，设置为开漏模式 */
                pin_mode = AMHW_MM32L373_GPIO_MODE_OUT_OD;
            }
            break;

        case AM_GPIO_OPEN_DRAIN_VAL:
            if (dir == 0) {
                /* 输入没有开漏模式，设置为浮空 */
                pin_mode = AMHW_MM32L373_GPIO_MODE_IN_FLOATING;
            } else {
                pin_mode = AMHW_MM32L373_GPIO_MODE_OUT_OD;
            }
            break;

        case AM_GPIO_PUSH_PULL_VAL:
            if (dir == 0) {
                /* 输入没有推挽模式，设置为上拉 */
                pin_mode = AMHW_MM32L373_GPIO_MODE_IPU;
            } else {
                pin_mode = AMHW_MM32L373_GPIO_MODE_OUT_PP;
            }
            break;

        default:
            return -AM_ENOTSUP;
        }

        amhw_mm32l373_gpio_pin_mode_set(p_hw_gpio, pin_mode, pin);
    }

    /* 平台相关 */
    if (0 != (flags & AM_MM32L373_GPIO_MODE)) {

        /* 输入输出相应模式设置 */

        switch (AM_MM32L373_GPIO_MODE_GET(flags)) {

        case 0:
            /* 设置为输入 */
            amhw_mm32l373_gpio_pin_dir_input(p_hw_gpio, pin);
            pin_mode = AMHW_MM32L373_GPIO_MODE_AIN;
            break;

        case 1:
            /* 设置为输入 */
            amhw_mm32l373_gpio_pin_dir_input(p_hw_gpio, pin);
            pin_mode = AMHW_MM32L373_GPIO_MODE_IN_FLOATING;
            break;

        case 2:
            /* 使OD位置为0, 表明是下拉 */
            amhw_mm32l373_gpio_pin_out_low(p_hw_gpio, pin);
            /* 设置为输入 */
            amhw_mm32l373_gpio_pin_dir_input(p_hw_gpio, pin);
            pin_mode = AMHW_MM32L373_GPIO_MODE_IPD;
            break;

        case 3:
            /* 使OD位置为1, 表明是上拉 */
            amhw_mm32l373_gpio_pin_out_high(p_hw_gpio, pin);
            /* 设置为输入 */
            amhw_mm32l373_gpio_pin_dir_input(p_hw_gpio, pin);
            pin_mode = AMHW_MM32L373_GPIO_MODE_IPU;
            break;

        case 4:
            /* 设置为输出并设置响应频率，默认为50Mhz */
            if (0 != (flags & AM_MM32L373_GPIO_OUTRES_RATE)) {
                amhw_mm32l373_gpio_pin_dir_output(
                    p_hw_gpio,
                    (amhw_mm32l373_gpio_speed_mode_t)AM_MM32L373_GPIO_OUTRES_RATE_GET(flags),
                    pin);
            } else {
                amhw_mm32l373_gpio_pin_dir_output(p_hw_gpio,
                                                AMHW_MM32L373_GPIO_SPEED_50MHz,
                                                pin);
            }
            pin_mode = AMHW_MM32L373_GPIO_MODE_OUT_PP;
            break;

        case 5:
            /* 设置为输出并设置响应频率，默认为50Mhz */
            if (0 != (flags & AM_MM32L373_GPIO_OUTRES_RATE)) {
                amhw_mm32l373_gpio_pin_dir_output(
                    p_hw_gpio,
                    (amhw_mm32l373_gpio_speed_mode_t)AM_MM32L373_GPIO_OUTRES_RATE_GET(flags),
                    pin);
            } else {
                amhw_mm32l373_gpio_pin_dir_output(p_hw_gpio,
                                                AMHW_MM32L373_GPIO_SPEED_50MHz,
                                                pin);
            }
            pin_mode = AMHW_MM32L373_GPIO_MODE_OUT_OD;
            break;

