zlgopen/ametal/soc/mm32/drivers/source/gpio/am_mm32l373_gpio.c
        case 6:
            /* 设置为输出并设置响应频率，默认为50Mhz */
            if (0 != (flags & AM_MM32L373_GPIO_OUTRES_RATE)) {
                amhw_mm32l373_gpio_pin_dir_output(
                    p_hw_gpio,
                    (amhw_mm32l373_gpio_speed_mode_t)AM_MM32L373_GPIO_OUTRES_RATE_GET(flags),
                    pin);
            } else {
                amhw_mm32l373_gpio_pin_dir_output(p_hw_gpio,
                                AMHW_MM32L373_GPIO_SPEED_50MHz, pin);
            }
            pin_mode = AMHW_MM32L373_GPIO_MODE_AF_PP;
            break;

        case 7:
            /* 设置为输出并设置响应频率，默认为50Mhz */
            if (0 != (flags & AM_MM32L373_GPIO_OUTRES_RATE)) {
                amhw_mm32l373_gpio_pin_dir_output(
                    p_hw_gpio,
                    (amhw_mm32l373_gpio_speed_mode_t)AM_MM32L373_GPIO_OUTRES_RATE_GET(flags),
                    pin);
            } else {
                amhw_mm32l373_gpio_pin_dir_output(p_hw_gpio,
                                AMHW_MM32L373_GPIO_SPEED_50MHz, pin);
            }
            pin_mode = AMHW_MM32L373_GPIO_MODE_AF_OD;
            break;

        default:
            return -AM_ENOTSUP;
        }

        amhw_mm32l373_gpio_pin_mode_set(p_hw_gpio, pin_mode, pin);
    }

    /* 重映像设置 */
    if (0 != (flags & AM_MM32L373_GPIO_REMAP)) {

        /* 新重映像与当前重映像不等， NO -> 外设重映像 ； 外设重映像 -> NO ； 外设1 -> 外设2 */
        if (AM_MM32L373_GPIO_REMAP_PERIPHERAL_GET(flags) !=
                                               p_gpio_devinfo->p_remap[pin]) {

            /* NO -> 外设重映像，当前引脚无重映像可不做任何处理 */
            if (p_gpio_devinfo->p_remap[pin] == AMHW_MM32L373_NO_REMAP) {

                /* 保存当前引脚重映像信息 */
                p_gpio_devinfo->p_remap[pin] =
                                     (amhw_mm32l373_afio_remap_peripheral_t)
                                     AM_MM32L373_GPIO_REMAP_PERIPHERAL_GET(flags);

            } else if (AM_MM32L373_GPIO_REMAP_PERIPHERAL_GET(flags) == AMHW_MM32L373_NO_REMAP) {

                /*
                 * 外设重映像 -> NO
                 * 清除当前引脚对应外设的重映像模式，该外设将不能正常工作，需要重新配置
                 * 清楚外设重映像模式需要将所影响的所有GPIO重映像信息重写
                 */

                /* 清除外设的重映像，并对所影响的GPIO初始化 */
                __am_mm32l373_peripheral_remap_clear(pin);

                /* 保存当前引脚重映像信息 */
                p_gpio_devinfo->p_remap[pin] = AMHW_MM32L373_NO_REMAP;

                return AM_OK;
            } else {

                /*
                 * 外设1 -> 外设2
                 * 清除当前引脚对应外设的重映像模式，设置新的重映像
                 * 清楚外设重映像模式需要将所影响的所有GPIO重映像信息重写
                 */

                /* 清除外设的重映像，并对所影响的GPIO初始化 */
                __am_mm32l373_peripheral_remap_clear(pin);

                /* 保存当前引脚重映像信息 */
                p_gpio_devinfo->p_remap[pin] =
                                     (amhw_mm32l373_afio_remap_peripheral_t)
                                     AM_MM32L373_GPIO_REMAP_PERIPHERAL_GET(flags);
            }
        } else {

            /* 新重映像与当前重映像相等，按外设重新写入相应对应重映像前需要清楚前前重映像影响的GPIO */
            if (p_gpio_devinfo->p_remap[pin] != AMHW_MM32L373_NO_REMAP) {

                __am_mm32l373_peripheral_remap_clear(pin);
            }
        }

        /* 按外设设置重映像模式 */
        switch (AM_MM32L373_GPIO_REMAP_PERIPHERAL_GET(flags)) {

        case AMHW_MM32L373_SPI1_REMAP:
            if (1 == AM_MM32L373_GPIO_REMAP_MODE_GET(flags)) {

                amhw_mm32l373_afio_spi1_pin_remap_enable(p_hw_afio);
            } else if (0 == AM_MM32L373_GPIO_REMAP_MODE_GET(flags)) {

                amhw_mm32l373_afio_spi1_pin_remap_disable(p_hw_afio);
            }
            break;

        case AMHW_MM32L373_I2C1_REMAP:
            if (1 == AM_MM32L373_GPIO_REMAP_MODE_GET(flags)) {

                amhw_mm32l373_afio_i2c1_pin_remap_enable(p_hw_afio);
            } else if (0 == AM_MM32L373_GPIO_REMAP_MODE_GET(flags)) {

                amhw_mm32l373_afio_i2c1_pin_remap_disable(p_hw_afio);
            }
            break;

        case AMHW_MM32L373_UART1_REMAP:
            if (1 == AM_MM32L373_GPIO_REMAP_MODE_GET(flags)) {

                amhw_mm32l373_afio_uart_pin_remap_enable(p_hw_afio, 1);
            } else if (0 == AM_MM32L373_GPIO_REMAP_MODE_GET(flags)) {

                amhw_mm32l373_afio_uart_pin_remap_disable(p_hw_afio, 1);
            }
            break;

        case AMHW_MM32L373_UART3_REMAP:
            if (1 == AM_MM32L373_GPIO_REMAP_MODE_GET(flags)) {

                amhw_mm32l373_afio_uart_pin_remap_enable(p_hw_afio, 3);
            } else if (0 == AM_MM32L373_GPIO_REMAP_MODE_GET(flags)) {

                amhw_mm32l373_afio_uart_pin_remap_disable(p_hw_afio, 3);
            }
            break;

        case AMHW_MM32L373_TIM1_REMAP:
            if (1 == AM_MM32L373_GPIO_REMAP_MODE_GET(flags)) {

                amhw_mm32l373_afio_tim1_pin_remap_enable(p_hw_afio);
            } else if (0 == AM_MM32L373_GPIO_REMAP_MODE_GET(flags)) {

                amhw_mm32l373_afio_tim1_pin_remap_disable(p_hw_afio);
            }
            break;

        case AMHW_MM32L373_TIM2_REMAP:
            amhw_mm32l373_afio_tim2_remap_mode_set(
                p_hw_afio,
                (amhw_mm32l373_afio_tim2_remap_mode_t)AM_MM32L373_GPIO_REMAP_MODE_GET(flags));
            break;

        case AMHW_MM32L373_TIM3_REMAP:
            amhw_mm32l373_afio_tim3_remap_mode_set(
                p_hw_afio,
                (amhw_mm32l373_afio_tim3_remap_mode_t)AM_MM32L373_GPIO_REMAP_MODE_GET(flags));
            break;

        case AMHW_MM32L373_CAN_REMAP:
            amhw_mm32l373_afio_can_remap_mode_set(
                p_hw_afio,
                (amhw_mm32l373_afio_can_remap_mode_t)AM_MM32L373_GPIO_REMAP_MODE_GET(flags));
            break;

        case AMHW_MM32L373_PD01_REMAP:
            if (1 == AM_MM32L373_GPIO_REMAP_MODE_GET(flags)) {

                amhw_mm32l373_afio_pd01_pin_remap_enable(p_hw_afio);
            } else if (0 == AM_MM32L373_GPIO_REMAP_MODE_GET(flags)) {

                amhw_mm32l373_afio_pd01_pin_remap_disable(p_hw_afio);
            }
            break;

        case AMHW_MM32L373_SWJ_CFG:
            amhw_mm32l373_afio_swj_cfg_remap_mode_set(
                p_hw_afio,
                (amhw_mm32l373_afio_swj_cfg_mode_t)AM_MM32L373_GPIO_REMAP_MODE_GET(flags));
            break;

