zlgopen/ametal/soc/mm32/drivers/source/gpio/am_mm32l373_gpio.c
        case AMHW_MM32L373_NO_REMAP:
            break;

        default:
            return -AM_ENOTSUP;
        }
    }

    return AM_OK;
}

/**
 * \brief 获取GPIO引脚状态
 * \param[in] pin : 引脚编号，值为 PIO* (#PIOA_0)
 * \return 引脚状态
 */
int am_gpio_get (int pin)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);

    amhw_mm32l373_gpio_t     *p_hw_gpio  = NULL;

    if (__gp_gpio_dev == NULL) {
        return -AM_ENXIO;
    }

    p_hw_gpio  = (amhw_mm32l373_gpio_t *)p_gpio_devinfo->gpio_regbase;

    if (amhw_mm32l373_gpio_pin_dir_get(p_hw_gpio, pin)) {
        return amhw_mm32l373_gpio_pin_output_get(p_hw_gpio, pin);
    } else {
        return amhw_mm32l373_gpio_pin_input_get(p_hw_gpio, pin);
    }
}

/**
 * \brief 设置引脚输出状态
 *
 * \param[in] pin   : 引脚编号，值为 PIO* (#PIOA_0)
 * \param[in] value : 引脚状态，参见
 *                    \ref grp_am_gpio_pin_level
 *
 * \retval  AM_OK   : 操作成功
 */
int am_gpio_set (int pin, int value)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);

    amhw_mm32l373_gpio_t     *p_hw_gpio  = NULL;

    if (__gp_gpio_dev == NULL) {
        return -AM_ENXIO;
    }

    p_hw_gpio  = (amhw_mm32l373_gpio_t *)p_gpio_devinfo->gpio_regbase;

    if (value == 0) {
        amhw_mm32l373_gpio_pin_out_low(p_hw_gpio, pin);
    } else {
        amhw_mm32l373_gpio_pin_out_high(p_hw_gpio, pin);
    }

    return AM_OK;
}

/**
 * \brief 翻转GPIO引脚输出状态
 * \param[in] pin : 引脚编号，值为 PIO* (#PIOA_0)
 * \retval  AM_OK : 操作成功
 */
int am_gpio_toggle (int pin)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);

    amhw_mm32l373_gpio_t     *p_hw_gpio  = NULL;

    if (__gp_gpio_dev == NULL) {
        return -AM_ENXIO;
    }

    p_hw_gpio  = (amhw_mm32l373_gpio_t *)p_gpio_devinfo->gpio_regbase;

    amhw_mm32l373_gpio_pin_out_toggle(p_hw_gpio, pin);

    return AM_OK;
}

/**
 * \brief 外部中断线0中断函数
 */
static void __port_exit0_int_isr (void * p_arg)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    uint8_t  slot = 0;

    am_pfnvoid_t pfn_isr   = NULL;
    void        *p_arg_tmp = NULL;

    amhw_mm32l373_exti_t   *p_hw_exti   = NULL;

    p_hw_exti   = (amhw_mm32l373_exti_t   *)p_gpio_devinfo->exti_regbase;

    /* 获取有关回调函数及参数 */
    pfn_isr   = p_gpio_devinfo->p_triginfo[slot].pfn_callback;
    p_arg_tmp = p_gpio_devinfo->p_triginfo[slot].p_arg;

    if (amhw_mm32l373_exti_pr_read(p_hw_exti,
                                 (amhw_mm32l373_line_num_t)(1ul << slot))) {
        if (pfn_isr != NULL) {
            pfn_isr(p_arg_tmp);
        }
    }

    /* 清中断标志 */
    amhw_mm32l373_exti_pending_clear(p_hw_exti,
                                   (amhw_mm32l373_line_num_t)(1ul << slot));
}

/**
 * \brief 外部中断线1中断函数
 */
static void __port_exit1_int_isr (void * p_arg)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    uint8_t  slot = 1;

    am_pfnvoid_t pfn_isr   = NULL;
    void        *p_arg_tmp = NULL;

    amhw_mm32l373_exti_t   *p_hw_exti   = NULL;

    p_hw_exti   = (amhw_mm32l373_exti_t *)p_gpio_devinfo->exti_regbase;

    /* 获取有关回调函数及参数 */
    pfn_isr   = p_gpio_devinfo->p_triginfo[slot].pfn_callback;
    p_arg_tmp = p_gpio_devinfo->p_triginfo[slot].p_arg;

    if (amhw_mm32l373_exti_pr_read(p_hw_exti,
                                 (amhw_mm32l373_line_num_t)(1ul << slot))) {
        if (pfn_isr != NULL) {
            pfn_isr(p_arg_tmp);
        }
    }

    /* 清中断标志 */
    amhw_mm32l373_exti_pending_clear(p_hw_exti,
                                   (amhw_mm32l373_line_num_t)(1ul << slot));
}

/**
 * \brief 外部中断线2中断函数
 */
static void __port_exit2_int_isr (void * p_arg)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    uint8_t  slot = 2;

    am_pfnvoid_t pfn_isr   = NULL;
    void        *p_arg_tmp = NULL;

    amhw_mm32l373_exti_t   *p_hw_exti   = NULL;

    p_hw_exti   = (amhw_mm32l373_exti_t *)p_gpio_devinfo->exti_regbase;

    /* 获取有关回调函数及参数 */
    pfn_isr   = p_gpio_devinfo->p_triginfo[slot].pfn_callback;
    p_arg_tmp = p_gpio_devinfo->p_triginfo[slot].p_arg;

    if (amhw_mm32l373_exti_pr_read(p_hw_exti,
                                 (amhw_mm32l373_line_num_t)(1ul << slot))) {
        if (pfn_isr != NULL) {
            pfn_isr(p_arg_tmp);
        }
    }

    /* 清中断标志 */
    amhw_mm32l373_exti_pending_clear(p_hw_exti,
                                   (amhw_mm32l373_line_num_t)(1ul << slot));
}

/**
 * \brief 外部中断线2中断函数
 */
static void __port_exit3_int_isr (void * p_arg)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    uint8_t  slot = 3;

    am_pfnvoid_t pfn_isr   = NULL;
    void        *p_arg_tmp = NULL;

    amhw_mm32l373_exti_t   *p_hw_exti   = NULL;

    p_hw_exti   = (amhw_mm32l373_exti_t *)p_gpio_devinfo->exti_regbase;

    /* 获取有关回调函数及参数 */
    pfn_isr   = p_gpio_devinfo->p_triginfo[slot].pfn_callback;
    p_arg_tmp = p_gpio_devinfo->p_triginfo[slot].p_arg;

    if (amhw_mm32l373_exti_pr_read(p_hw_exti,
                                 (amhw_mm32l373_line_num_t)(1ul << slot))) {
        if (pfn_isr != NULL) {
            pfn_isr(p_arg_tmp);
        }
    }

    /* 清中断标志 */
    amhw_mm32l373_exti_pending_clear(p_hw_exti,
                                   (amhw_mm32l373_line_num_t)(1ul << slot));
}

/**
 * \brief 外部中断线4中断函数
 */
static void __port_exit4_int_isr (void * p_arg)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    uint8_t  slot = 4;

    am_pfnvoid_t pfn_isr   = NULL;
    void        *p_arg_tmp = NULL;

    amhw_mm32l373_exti_t   *p_hw_exti   = NULL;

    p_hw_exti   = (amhw_mm32l373_exti_t *)p_gpio_devinfo->exti_regbase;

    /* 获取有关回调函数及参数 */
    pfn_isr   = p_gpio_devinfo->p_triginfo[slot].pfn_callback;
    p_arg_tmp = p_gpio_devinfo->p_triginfo[slot].p_arg;

    if (amhw_mm32l373_exti_pr_read(p_hw_exti,
                                 (amhw_mm32l373_line_num_t)(1ul << slot))) {
        if (pfn_isr != NULL) {
            pfn_isr(p_arg_tmp);
        }
    }

    /* 清中断标志 */
    amhw_mm32l373_exti_pending_clear(p_hw_exti,
                                   (amhw_mm32l373_line_num_t)(1ul << slot));
}

/**
 * \brief 外部中断线9_5中断函数
 */
static void __port_exit9_5_int_isr (void * p_arg)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    am_pfnvoid_t pfn_isr    = NULL;
    void         *p_arg_tmp = NULL;
    uint8_t      slot       = 5;

    amhw_mm32l373_exti_t   *p_hw_exti   = NULL;

