zlgopen/ametal/soc/mm32/drivers/source/gpio/am_mm32l373_gpio.c
    p_hw_exti   = (amhw_mm32l373_exti_t   *)p_gpio_devinfo->exti_regbase;

    for (slot = 5 ; slot < 10 ; slot++) {
        if (amhw_mm32l373_exti_pr_read(p_hw_exti,
                                     (amhw_mm32l373_line_num_t)(1ul << slot))) {

            pfn_isr   = p_gpio_devinfo->p_triginfo[slot].pfn_callback;
            p_arg_tmp = p_gpio_devinfo->p_triginfo[slot].p_arg;

            if (NULL != pfn_isr) {
                pfn_isr(p_arg_tmp);
            }

            amhw_mm32l373_exti_pending_clear(p_hw_exti,
                                         (amhw_mm32l373_line_num_t)(1ul << slot));

            break;
        }
    }
}

/**
 * \brief 外部中断线5_10中断函数
 */
static void __port_exit15_10_int_isr (void * p_arg)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    am_pfnvoid_t pfn_isr    = NULL;
    void         *p_arg_tmp = NULL;
    uint8_t      slot       = 10;

    amhw_mm32l373_exti_t   *p_hw_exti   = NULL;

    p_hw_exti   = (amhw_mm32l373_exti_t   *)p_gpio_devinfo->exti_regbase;

    for (slot = 10 ; slot < 16 ; slot++) {
        if (amhw_mm32l373_exti_pr_read(p_hw_exti,
                                     (amhw_mm32l373_line_num_t)(1ul << slot))) {

            pfn_isr   = p_gpio_devinfo->p_triginfo[slot].pfn_callback;
            p_arg_tmp = p_gpio_devinfo->p_triginfo[slot].p_arg;

            if (NULL != pfn_isr) {
                pfn_isr(p_arg_tmp);
            }

            amhw_mm32l373_exti_pending_clear(p_hw_exti,
                                         (amhw_mm32l373_line_num_t)(1ul << slot));

            break;
        }
    }
}

/**
 * \brief GPIO初始化
 *
 * \param[in] p_dev     : 指向GPIO设备的指针
 * \param[in] p_devinfo : 指向GPIO设备信息的指针
 *
 * \retval AM_OK : 操作成功
 */
int am_mm32l373_gpio_init (am_mm32l373_gpio_dev_t           *p_dev,
                         const am_mm32l373_gpio_devinfo_t *p_devinfo)
{
    uint8_t i = 0;

    if (NULL == p_dev || NULL == p_devinfo) {
        return -AM_EINVAL;
    }

    if (p_devinfo->pfn_plfm_init) {
        p_devinfo->pfn_plfm_init();
    }

    p_dev->p_devinfo = p_devinfo;

    if ((p_devinfo->p_remap == NULL) || (p_devinfo->inum_pin == NULL) ||
        (p_devinfo->p_infomap == NULL) || (p_devinfo->p_triginfo == NULL)) {
        p_dev->valid_flg = AM_FALSE;
        return -AM_EINVAL;
    }

    for (i = 0 ; i < p_devinfo->pin_count ; i++) {
        if ((i == PIOA_13) || (i == PIOA_14) || (i == PIOA_15) ||
             (i == PIOB_3) || (i == PIOB_4)) {
            p_devinfo->p_remap[i] = AMHW_MM32L373_SWJ_CFG;
        } else {
            p_devinfo->p_remap[i] = AMHW_MM32L373_NO_REMAP;
        }
    }

    for (i = 0 ; i < p_devinfo->exti_num_max ; i++) {
        p_devinfo->p_infomap[i] = AM_MM32L373_GPIO_INVALID_PIN_MAP;
        p_devinfo->p_triginfo[i].p_arg = NULL;
        p_devinfo->p_triginfo[i].pfn_callback = NULL;
    }

    am_int_connect(p_devinfo->inum_pin[0], __port_exit0_int_isr, NULL);
    am_int_connect(p_devinfo->inum_pin[1], __port_exit1_int_isr, NULL);
    am_int_connect(p_devinfo->inum_pin[2], __port_exit2_int_isr, NULL);
    am_int_connect(p_devinfo->inum_pin[3], __port_exit3_int_isr, NULL);
    am_int_connect(p_devinfo->inum_pin[4], __port_exit4_int_isr, NULL);

    am_int_connect(p_devinfo->inum_pin[5], __port_exit9_5_int_isr, NULL);
    am_int_connect(p_devinfo->inum_pin[6], __port_exit15_10_int_isr, NULL);

    am_int_enable(p_devinfo->inum_pin[0]);
    am_int_enable(p_devinfo->inum_pin[1]);
    am_int_enable(p_devinfo->inum_pin[2]);
    am_int_enable(p_devinfo->inum_pin[3]);
    am_int_enable(p_devinfo->inum_pin[4]);
    am_int_enable(p_devinfo->inum_pin[5]);
    am_int_enable(p_devinfo->inum_pin[6]);

    p_dev->valid_flg = AM_TRUE;

    __gp_gpio_dev = p_dev;

    return AM_OK;
}

/**
 * \brief GPIO去初始化
 *
 * \param[in] 无
 *
 * \return 无
 */
void am_mm32l373_gpio_deinit (void)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    uint8_t i;

    if (p_gpio_devinfo->pfn_plfm_deinit) {
        p_gpio_devinfo->pfn_plfm_deinit();
    }

    if (__gp_gpio_dev->valid_flg == AM_FALSE) {
        return;
    }

    for (i = 0 ; i < p_gpio_devinfo->pin_count ; i++) {
        if ((i == PIOA_13) || (i == PIOA_14) || (i == PIOA_15) ||
             (i == PIOB_3) || (i == PIOB_4)) {
            p_gpio_devinfo->p_remap[i] = AMHW_MM32L373_SWJ_CFG;
        } else {
            p_gpio_devinfo->p_remap[i] = AMHW_MM32L373_NO_REMAP;
        }
    }

    for (i = 0 ; i < p_gpio_devinfo->exti_num_max ; i++) {
        p_gpio_devinfo->p_infomap[i] = AM_MM32L373_GPIO_INVALID_PIN_MAP;
        p_gpio_devinfo->p_triginfo[i].p_arg = NULL;
        p_gpio_devinfo->p_triginfo[i].pfn_callback = NULL;
    }

    am_int_disable(p_gpio_devinfo->inum_pin[0]);
    am_int_disable(p_gpio_devinfo->inum_pin[1]);
    am_int_disable(p_gpio_devinfo->inum_pin[2]);
    am_int_disable(p_gpio_devinfo->inum_pin[3]);
    am_int_disable(p_gpio_devinfo->inum_pin[4]);
    am_int_disable(p_gpio_devinfo->inum_pin[5]);
    am_int_disable(p_gpio_devinfo->inum_pin[6]);

    am_int_disconnect(p_gpio_devinfo->inum_pin[0], __port_exit0_int_isr, NULL);
    am_int_disconnect(p_gpio_devinfo->inum_pin[1], __port_exit1_int_isr, NULL);
    am_int_disconnect(p_gpio_devinfo->inum_pin[2], __port_exit2_int_isr, NULL);
    am_int_disconnect(p_gpio_devinfo->inum_pin[3], __port_exit3_int_isr, NULL);
    am_int_disconnect(p_gpio_devinfo->inum_pin[4], __port_exit4_int_isr, NULL);
    am_int_disconnect(p_gpio_devinfo->inum_pin[5], __port_exit9_5_int_isr, NULL);
    am_int_disconnect(p_gpio_devinfo->inum_pin[6], __port_exit15_10_int_isr, NULL);

    __gp_gpio_dev = NULL;
}

/**
 * \brief 配置GPIO引脚触发功能
 *
 * \param[in] pin  : 引脚编号，值为 PIO* (#PIOA_0)
 * \param[in] flag : 配置参数，参见
 *                   \ref grp_am_gpio_pin_trigger_function
 *
 * \retval AM_OK   : 配置成功
 */
int am_gpio_trigger_cfg (int pin, uint32_t flag)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);

    amhw_mm32l373_gpio_t     *p_hw_gpio  = NULL;
    amhw_mm32l373_exti_t     *p_hw_exti  = NULL;
    amhw_mm32l373_afio_t     *p_hw_afio  = NULL;
    uint8_t                 slot       = pin & 0x0f;

    if (__gp_gpio_dev == NULL) {
        return -AM_ENXIO;
    }

    p_hw_gpio = (amhw_mm32l373_gpio_t *)p_gpio_devinfo->gpio_regbase;
    p_hw_exti = (amhw_mm32l373_exti_t *)p_gpio_devinfo->exti_regbase;
    p_hw_afio = (amhw_mm32l373_afio_t *)p_gpio_devinfo->afio_regbase;

