zlgopen/ametal/soc/mm32/drivers/source/gpio/am_mm32l373_gpio.c
    if (slot > (p_gpio_devinfo->exti_num_max - 1)) {
        return -AM_ENOSPC;
    }

    if (p_gpio_devinfo->p_infomap[slot] != pin) {
        return -AM_EINVAL;
    }

    /* 使用GPIO功能 */
    __am_mm32l373_peripheral_remap_clear(pin);

    /* 设置管脚为输入方向 */
    amhw_mm32l373_gpio_pin_dir_input(p_hw_gpio, pin);

    /* 管脚为上拉/下拉模式 */
    amhw_mm32l373_gpio_pin_mode_set(p_hw_gpio, AMHW_MM32L373_GPIO_MODE_IPD, pin);
    /*
     * 中断线0只能连一个端口编号为0的GPIO引脚，比如说，PIOA_0连接到了中断线0，
     * PIOB_0、PIOC_0、PIOD_0就不能连到中断线0, 但此时PIOA_1可以连接到中断线1。
     */
    amhw_mm32l373_afio_exti_pin_set(p_hw_afio, pin);

    /* 清除中断线配置 */
    amhw_mm32l373_exti_imr_clear(p_hw_exti,
                               (amhw_mm32l373_line_num_t)(1ul << slot));
    amhw_mm32l373_exti_emr_clear(p_hw_exti,
                               (amhw_mm32l373_line_num_t)(1ul << slot));

    /* 清除中断线触发方式配置 */
    amhw_mm32l373_exti_rtsr_clear(p_hw_exti,
                                (amhw_mm32l373_line_num_t)(1ul << slot));
    amhw_mm32l373_exti_ftsr_clear(p_hw_exti,
                                (amhw_mm32l373_line_num_t)(1ul << slot));

    switch (flag) {

    case AM_GPIO_TRIGGER_OFF:
        break;

    case AM_GPIO_TRIGGER_RISE:
        /* 使OD位置为0, 表明是下拉 */
        amhw_mm32l373_gpio_pin_out_low(p_hw_gpio, pin);
        amhw_mm32l373_exti_rtsr_set(p_hw_exti,
                                  (amhw_mm32l373_line_num_t)(1ul << slot));
        break;

    case AM_GPIO_TRIGGER_FALL:
        /* 使OD位置为1, 表明是上拉 */
        amhw_mm32l373_gpio_pin_out_high(p_hw_gpio, pin);
        /* falling  edge */
        amhw_mm32l373_exti_ftsr_set(p_hw_exti,
                                  (amhw_mm32l373_line_num_t)(1ul << slot));
        break;

    case AM_GPIO_TRIGGER_BOTH_EDGES:
        /* 使OD位置为1, 表明是上拉 */
        amhw_mm32l373_gpio_pin_out_high(p_hw_gpio, pin);
        /* falling  edge */
        amhw_mm32l373_exti_ftsr_set(p_hw_exti,
                                  (amhw_mm32l373_line_num_t)(1ul << slot));
        amhw_mm32l373_exti_rtsr_set(p_hw_exti,
                                  (amhw_mm32l373_line_num_t)(1ul << slot));
        break;

    default:
        return -AM_ENOTSUP;
    }

    return AM_OK;
}

/**
 * \brief 连接回调函数到引脚
 *
 * \param[in] pin          : 引脚编号，值为 PIO* (#PIOA_0)
 * \param[in] pfn_callback : 回调函数指针
 * \param[in] p_arg        : 回调函数的入口参数
 *
 * \retval  AM_OK          : 操作成功
 */
int am_gpio_trigger_connect(int           pin,
                            am_pfnvoid_t  pfn_callback,
                            void         *p_arg)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    uint8_t                  slot        = pin & 0x0f;
    int key;

    if (__gp_gpio_dev == NULL) {
        return -AM_ENXIO;
    }

    if (AM_FALSE == __gp_gpio_dev->valid_flg) {
        return -AM_ENODEV;
    }

    if (slot > (p_gpio_devinfo->exti_num_max - 1)) {
        return -AM_ENOSPC;
    }

    key = am_int_cpu_lock();

    if (p_gpio_devinfo->p_infomap[slot] == AM_MM32L373_GPIO_INVALID_PIN_MAP) {

        p_gpio_devinfo->p_infomap[slot] = pin;
        p_gpio_devinfo->p_triginfo[slot].p_arg = p_arg;
        p_gpio_devinfo->p_triginfo[slot].pfn_callback = pfn_callback;

    } else {

        am_int_cpu_unlock(key);
        return -AM_EINVAL;
    }

    am_int_cpu_unlock(key);

    return AM_OK;
}

/**
 * \brief 删除连接到引脚的回调函数
 *
 * \param[in] pin          : 引脚编号，值为 PIO* (#PIOA_0)
 * \param[in] pfn_callback : 回调函数指针
 * \param[in] p_arg        : 回调函数的入口参数
 *
 * \retval  AM_OK          : 操作成功
 */
int am_gpio_trigger_disconnect(int           pin,
                               am_pfnvoid_t  pfn_callback,
                               void         *p_arg)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    uint8_t                  slot        = pin & 0x0f;
    int key;

    if (__gp_gpio_dev == NULL) {
        return -AM_ENXIO;
    }

    if (slot > (p_gpio_devinfo->exti_num_max - 1)) {
        return -AM_ENOSPC;
    }

    key = am_int_cpu_lock();

    if (p_gpio_devinfo->p_infomap[slot] == pin) {

        p_gpio_devinfo->p_infomap[slot] = AM_MM32L373_GPIO_INVALID_PIN_MAP;
        p_gpio_devinfo->p_triginfo[slot].p_arg = NULL;
        p_gpio_devinfo->p_triginfo[slot].pfn_callback = NULL;

    } else {
        am_int_cpu_unlock(key);
        return -AM_EINVAL;
    }

    am_int_cpu_unlock(key);

    return AM_OK;
}

/**
 * \brief 使能引脚触发中断
 * \param[in] pin : 引脚编号，值为 PIO* (#PIOA_0)
 * \retval  AM_OK : 操作成功
 */
int am_gpio_trigger_on(int pin)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    amhw_mm32l373_exti_t *p_hw_exti  = NULL;
    uint8_t             slot       = pin & 0x0f;

    if (__gp_gpio_dev == NULL) {
        return -AM_ENXIO;
    }

    if (slot > (p_gpio_devinfo->exti_num_max - 1)) {
        return -AM_ENOSPC;
    }

    p_hw_exti = (amhw_mm32l373_exti_t *)p_gpio_devinfo->exti_regbase;

    if (p_gpio_devinfo->p_infomap[slot] == pin) {

        amhw_mm32l373_exti_pending_clear(p_hw_exti,
                                       (amhw_mm32l373_line_num_t)(1ul << slot));
        amhw_mm32l373_exti_imr_set(p_hw_exti,
                                 (amhw_mm32l373_line_num_t)(1ul << slot));

    } else {
        return -AM_ENXIO;
    }

    return AM_OK;
}

/**
 * \brief 禁能引脚触发中断
 * \param[in] pin : 引脚编号，值为 PIO* (#PIOA_0)
 * \retval  AM_OK : 操作成功
 */
int am_gpio_trigger_off(int pin)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    amhw_mm32l373_exti_t *p_hw_exti  = NULL;
    uint8_t             slot       = pin & 0x0f;

    if (__gp_gpio_dev == NULL) {
        return -AM_ENXIO;
    }

    p_hw_exti = (amhw_mm32l373_exti_t *)p_gpio_devinfo->exti_regbase;

    if (p_gpio_devinfo->p_infomap[slot] == pin) {

        amhw_mm32l373_exti_imr_clear(p_hw_exti,
                                   (amhw_mm32l373_line_num_t)(1ul << slot));
        amhw_mm32l373_exti_emr_clear(p_hw_exti,
                                   (amhw_mm32l373_line_num_t)(1ul << slot));

    } else {
        return -AM_ENXIO;
    }

    return AM_OK;
}

/* end of file */
